#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УдалитьЛишниеПробелы(Знач ИсходнаяСтрока) Экспорт
	
	ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
	Возврат ИсходнаяСтрока
	
КонецФункции

Функция ДоопределитьУдалитьЛишниеПробелы(Знач ИсходнаяСтрока)
	
	//ПеременнаяЧисло = Строка(2 ;
		
	Текст = 
	
	"ВЫБРАТЬ
	| 	РасходнаяНакладнаяТовары.Товар
	| ПОМЕСТИТЬ ВТТовар
	| ИЗ
	| 	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	| ГДЕ
	| 	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
	| ;
	| ВЫБРАТЬ
	| 	ОстатокТоваровОстатки.Товар,
	| 	ВТТовар.Товар
	| ИЗ
	| 	ВТТовар КАК ВТТовар
	| 		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстатокТоваров.Остатки КАК ОстатокТоваровОстатки
	| 			ПО ВТТовар.Товар = ОстатокТоваровОстатки.Товар
	| 			И ОстатокТоваровОстатки.Склад = &Склад";
		
	Возврат Ложь
	
КонецФункции

#КонецОбласти